     
     dcl-s Value1 zoned(10);
     dcl-s Value2 zoned(10);

     dcl-s Answere zoned(10);


     Answere = Value1 + Value2;
     dsply Answere;
     
     *inlr = *on;
